#include "stdio.h"
/**
 * 运算符
 * 算数运算符: + - * / % ++ --
 * 赋值运算符: = += -= *= /=
 * 关系运算符: < <= == > >= !=
 * 逻辑运算符: && || !
 * 位运算符: & | ^ ~ << >>
 * 三元运算符: 表达式?结果1:结果2
 */
void main(){
    //算数运算符
    int a1 = 1+1;//加

    int a2 = 1-1;//减

    int a3 = 1*1;//乘

    double d1 = 10/4;//除,10/4=2.5,但是因为10和4均为整数,所以结果为2
    double d2 = 10.0/4;//因为10.0为浮点数,所以最终结果为2.5
    printf("d1 = %f\nd2 = %f\n",d1,d2);

    int m1 = 10%3;//取模,即10/3的余数,a % b等价于a - a/b * b
    int m2 = -10%3;// -10%3 = -10 - (-10) / 3 * 3 = -10 - (-3) * 3 = -10 + 9 = -1
    int m3 = 10%-3;// 10%-3 = 10 - 10 / (-3) * (-3) = 10 - (-3) * (-3) = 10 - 9 = 1
    printf("m1 = %d\nm2 = %d\nm3 = %d\n",m1,m2,m3);

    int i = 0;
    int j1 = i++;//等价于int j1 = i; i = i + 1;即先赋值再加一
    int j2 = ++i;//等价于i = i + 1; int j2 = i;即先加一再赋值
    printf("j1 = %d\nj2 = %d\n",j1,j2);
    i++;//也可以独立使用

    i = 0;
    int j3 = i--;//等价于int j3 = i; i = i - 1;即先赋值再减一
    int j4 = --i;//等价于i = i - 1; int j4 = i;即先减一再赋值
    printf("j3 = %d\nj4 = %d\n",j3,j4);
    i--;//也可以独立使用
    printf("----------\n");

    //赋值运算符, (变量1 符号= 变量2)等价于(变量1 = 变量1 符号 变量2)
    i = 1;//将1赋值给i
    i += 1;//将i+1赋值给i
    i -= 1;//将i-1赋值给i
    i *= 1;//将i*1赋值给i
    i /= 1;//将i/1赋值给i
    i %= 1;//将i%1赋值给i
    i &= 1;//按位与再赋值给i
    i ^= 1;//按位异或再赋值给i
    i |= 1;//按位或再赋值给i
    i <<= 1;//将i左移再赋值给i
    i >>= 1;//将i右移再赋值给i
    printf("----------\n");

    //关系运算符,结果要么是真(非0表示,默认为1),要么是假(0表示)
    int x = 3;
    int y = 4;
    printf("x>y?  %d\n",x>y);//大于
    printf("x<y?  %d\n",x<y);//小于
    printf("x==y? %d\n",x==y);//等于
    printf("x!=y? %d\n",x!=y);//不等于
    printf("x>=y? %d\n",x>=y);//大于等于
    printf("x<=y? %d\n",x<=y);//小于等于
    printf("----------\n");

    //逻辑运算符,用于连接多个条件,结果要么是真(非0表示,默认为1),要么是假(0表示)
    x = 1;
    y = 1;
    printf("x&&y? %d\n",x&&y);//与运算符,如果两个操作数都非零,则条件为真,默认返回1
    printf("x||y? %d\n",x||y);//或运算符,如果两个操作数中任意一个为非零,则条件为真,默认返回1
    printf("!x? %d\n",!x);//非运算符,用于逆转操作数的逻辑状态,如果为真,则返回假,如果为假,则返回真
    printf("x||++y?%d\ny = %d\n",x||++y,y);//注意,如果或运算符前面的操作数为真,则直接返回真,后面的操作数不会执行
    printf("----------\n");

    //位运算符,作用于位(具体详情在二进制中解释)
    1>>2;//1向右移两位
    1<<2;//1向右移两位
    1&2//按位与
    1|2//按位或
    1^2//按位异或
    1~2//按位取反

    //三元运算符,条件表达式?表达式1:表达式2     如果条件表达式为真,则执行表达式1;如果条件表达式为假,则执行表达式2
    x = 1;
    y = 1;
    int z = x==y?++x:--y;
    printf("z = %d\nx = %d\ny = %d\n",z,x,y);
    printf("----------\n");

    //运算优先级顺序  算术运算符 > 关系运算符 > 逻辑运算符(!除外) > 赋值运算符 > 逗号运算符
}