#include "stdio.h"
/**
 * 进制
 * 二进制(Binary system)(BIN)
 * 八进制(Octal number system)(OCT)
 * 十进制(Decimal system)(DEC)
 * 十六进制(Hexadecimal)(HEX)
 */
int main(){
    int i;
    i = 0b10;//二进制以0b或0B开头,后接0或1
    i = 01;//八进制以0开头,后接0-7
    i = 1;//十进制
    i = 0xE;//十六进制以0x或0X开头,后接0-9,A-F,a-f

    //二进制
    /*
     * 对于有符号的数:
     *      二进制的最高位为符号位:0表示正数,1表示负数
     *      正数的原码,反码,补码都一样
     *      负数的反码 = 原码的符号位不变,其他位取反
     *      负数的补码 = 负数的反码+1
     *      0的反码补码都为0
     *      计算机在运算时,都是以补码的方式来运算的
     */

    //正数的左右移,正数右移左补0,正数左移右补0
    i = 16>>2;//16向右移两位,16的二进制表示为10000,右移两位后为100,十进制为4
    i = 1<<2;//1向左移两位,1的二进制表示为1,左移两位后为100,十进制为4

    //负数的左右移,负数右移左补1,负数左移
    //-16的原码为10000000 00000000 00000000 00010000
    i = -16>>2;//右移后为 10000000 00000000 00000000 00000100 即-4
    i = -16<<2;//左移后为 10000000 00000000 00000000 01000000 即-64

    //按位与运算,两位全为1,则结果为1,否则为0, (1&1=1), (1&0=0), (0&1=0), (0&0=0)
    i = 21&4;//21的二进制表示为10101,7的二进制表示为111,与后为101 = 4

    //按位或运算,两位中有一位为1,则结果为1, (1|1=1), (1|0=1), (0|1=1), (0|0=0)
    i = 16|4;//16的二进制表示为10000,4的二进制表示为100,或后为10100 = 20

    //按位异或运算,两位不同为1,相同为0, (1^1=0), (1^0=1), (0^1=1), (0^0=0)
    i = 16^4;//16的二进制表示为10000,4的二进制表示为100,异或后为10100 = 20

    //取反运算,1变0,0变1
    i = ~16;//16的二进制表示为10000,即
    // 00000000 00000000 00000000 00010000 因为1为正数,所以原反补都一样
    // 11111111 11111111 11111111 11101111 取反后,为该数的补码,第一位符号位为负数,所以要转成原码
    // 11111111 11111111 11111111 11101110 补码 = 反码+1,反码 = 原码取反,所以原码 = 反码-1后取反,符号位不动
    // 10000000 00000000 00000000 00010001 原码为-10001 = -17

//    printf("%d\n",i);
    return 0;
}
