#include <stdio.h>
/**
 * 变量作用域
 * 局部变量:
 *      函数内部声明/定义的局部变量,只能在函数内部使用
 *      函数的参数,形式参数,被当做该函数的内的局部变量,如果与全局变量同名,则会优先使用局部变量(就近原则)
 *      代码块({})里声明的变量,只能在代码块里使用
 *      局部变量保存在栈中,函数被调用时才动态地分配存储单元
 *      局部变量,系统不会默认初始化,必须对局部变量初始化后才能使用,否则,程序运行会异常退出
 * 全局变量:
 *      在所有函数外部定义的变量叫全局变量,作用域在整个程序都有效
 *      全局变量保存在内存的全局存储区,占用静态存储单元
 *      全局变量,系统会自动对其进行初始化,以下是自动初始化值
 *          int       0
 *          char     '\0'
 *          float    0.0
 *          double   0.0
 *          pointer  NULL
 */
int i;//全局变量,默认初始化为0
void function(int i){
    printf("function:i = %d\n",i);
}
int main_(){
    function(1);
    printf("main:i = %d\n",i);

    //代码块里声明的变量,只能在代码块里使用
    for (int j = 0; j < 10; ++j) {
        int k = 1;//for循环里声明的变量,只能在for循环里面用
    }
}